package returningAlgorithms;

/**
 * Реализация алгоритмов с возвратом (просчитывают возможность справиться с поставленной задачей).
 * Используется для исключения заведомо ложных частичных решений.
 *
 */
public class ReturningRecursionAlgorithms {

    /**
     * Решение задачи о 8 ферзях метод алгоритма с возвратом.
     * Необходимо расставить на шахматной доске(64 клетки) 8 ферзей так,
     * чтобы они не могли атаковать друг друга(не находились на одной строчке, ряду или диагонали).
     */
    public static void eightQueenProblem() {

    }
}
